app/Http/Controllers/RecetaController.php

    public function create()
    {
        //esto nos trae todos los campos, pero solo necesitamos id y nombre
//        DB::table('categoria_recetas')->get()->dd();

        // Sin modelo
        //$categorias = DB::table('categoria_recetas')->get()->pluck('id', 'nombre');

        // Con modelo
        $categorias = CategoriaReceta::all(['id','nombre']);
---
select `id`, `nombre` from `categoria_recetas`